/*
Объектно-ориентированное программирование (семинары)
Урок 2. Принципы ООП Абстракция и интерфейсы. Пример проектирования
https://gb.ru/lessons/414497/homework

Домашнее задание 2

 * Рекомендации по выполнению ДЗ
 *
 * "QueueBehaviour" - это очередь
 * прописать поля ArrayList (реализация класса "Market" (?))
 * в "Market" взаимодействовать с полями

Реализовать класс Market и все методы, которые он обязан реализовывать. 
Методы из интерфейса QueueBehaviour, имитируют работу очереди, 
MarketBehaviour – помещает и удаляет человека из очереди, 
метод update – обновляет состояние магазина (принимает и отдает заказы)

<<class>>
Market

void: acceptToMarket 
void: acceptToMarket 
void: acceptToMarket

P.S.
Копировать все файлы папки "Ex02" семинара 2 
в папку "Home02" для выполнения ДЗ

 */

package OOP.Homework.Home02.Info;

public class InfoHome02 {
    
}
