/*
Объектно-ориентированное программирование (семинары)
Урок 1. Принципы ООП: Инкапсуляция, наследование, полиморфизм
https://gb.ru/lessons/414496

00:12:00

План курса

    ● Принципы ООП: Инкапсуляция, наследование, полиморфизм
    ● Принципы ООП Абстракция и интерфейсы. Пример проектирования
    ● Некоторые стандартные интерфейсы Java и примеры их использования
    ● ООП: Обобщения
    ● От простого к практике
    ● ООП Дизайн и Solid
    ● Есть ли жизнь без Java?


Как эффективно заниматься в асинхронном формате?

    � Не забывайте смотреть лекцию перед тем, как перейти к семинару;
    � Во время выполнения заданий ставьте видео на паузу 
       и пробуйте выполнить его самостоятельно;
    � После самостоятельного выполнения задания, обязательно посмотрите, 
       как преподаватель выполняет его и анализируйте свои действия;
    � Обязательно выполняйте домашнее задание после семинара;
    � Регулярно освежайте материал в памяти с помощью конспектов к лекциям, 
       видеолекций и других удобных вам материалов.


00:13:30

Что будет на уроке сегодня

    � Повторим теорию базовых определений ООП – 
       абстракция, инкапсуляция, наследование, полиморфизм
    � Получим практические навыки в написании сущностей 
       и логики согласно принципам ООП
    � Научимся составлять идеологически верный ООП программы


00:49:30

Ссылка на репозиторий GitHub с кодами:
https://github.com/besSmertniyKoder/untitled

*/