/*
Объектно-ориентированное программирование (лекции)
Урок 7. Есть ли жизнь без Java?
https://gb.ru/lessons/414495

 */
package OOP.Lesson.Les07.Mathematics.Shapes;

/*
 * Класс квадрат (Square)
 * Написать код самостоятельно на основе кодов 
 * прямоугольника (Rectangle), исходя из того, что
 * квадрат это прямоугольник, ширина и высота которого равны
 * и квадрат наследует прямоугольник, 
 * либо последний наследует квадрат
 * Нужно ли делать подобное наследование?
 */
public class Square {
    
}
