/*
Объектно-ориентированное программирование (лекции)
Урок 7. Есть ли жизнь без Java?
https://gb.ru/lessons/414495

 */
package OOP.Lesson.Les07.Mathematics.Shapes;

/*
 * Класс треугольник (Triangle)
 * Написать код самостоятельно на основе кодов 
 * прямоугольника (Rectangle) и квадрата (Square), исходя из того, что
 * площадь треугольника является половиной площади прямоугольника,
 * стороны которого равны основанию и высоте треугольника,
 * и треугольник наследует прямоугольник, 
 * либо последний наследует треугольник.
 * Нужно ли делать подобное наследование?
 */
public class Triangle {
    /// ???...
}
