/*
Объектно-ориентированное программирование (лекции)
Урок 5. ООП: От простого к практике
https://gb.ru/lessons/414493

 */
package OOP.Lesson.Les05.Ex003.Mathematics.Shapes;

/*
 * Класс квадрат (Square)
 * Написать код самостоятельно на основе кодов 
 * прямоугольника (Rectangle), исходя из того, что
 * квадрат это прямоугольник, ширина и высота которого равны
 * и квадрат наследует прямоугольник, 
 * либо последний наследует квадрат
 * Нужно ли делать подобное наследование?
 */
public class Square {
    
}
